In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [24]:
%%sql
USE employees;

 * mysql://root:***@localhost/employees
0 rows affected.

[]

In [25]:
%%sql
SELECT *
FROM emp_manager
ORDER BY emp_manager.emp_no;

 * mysql://root:***@localhost/employees
42 rows affected.

[(10001, 'd005', 110022),
 (10002, 'd007', 110022),
 (10003, 'd004', 110022),
 (10004, 'd004', 110022),
 (10005, 'd003', 110022),
 (10006, 'd005', 110022),
 (10007, 'd008', 110022),
 (10008, 'd005', 110022),
 (10009, 'd006', 110022),
 (10010, 'd004', 110022),
 (10011, 'd009', 110022),
 (10012, 'd005', 110022),
 (10013, 'd003', 110022),
 (10014, 'd005', 110022),
 (10015, 'd008', 110022),
 (10016, 'd007', 110022),
 (10017, 'd001', 110022),
 (10018, 'd004', 110022),
 (10019, 'd008', 110022),
 (10020, 'd004', 110022),
 (10021, 'd005', 110039),
 (10022, 'd005', 110039),
 (10023, 'd005', 110039),
 (10024, 'd004', 110039),
 (10025, 'd005', 110039),
 (10026, 'd004', 110039),
 (10027, 'd005', 110039),
 (10028, 'd005', 110039),
 (10029, 'd004', 110039),
 (10030, 'd004', 110039),
 (10031, 'd005', 110039),
 (10032, 'd004', 110039),
 (10033, 'd006', 110039),
 (10034, 'd007', 110039),
 (10035, 'd004', 110039),
 (10036, 'd003', 110039),
 (10037, 'd005', 110039),
 (10038, 'd009', 110039),
 (10039, 'd003', 110039),
 (10040, 'd005', 110039),
 (110022, 'd001', 110039),
 (110039, 'd001', 110022)]

In [ ]:
#from the employee manager table、 created in the previous exercise,extract the record data only of those employees who are managers as well.

In [26]:
%%sql
SELECT DISTINCT e1.*
FROM emp_manager e1
JOIN 
	emp_manager e2 ON e1.emp_no = e2.manager_no;

 * mysql://root:***@localhost/employees
2 rows affected.

[(110022, 'd001', 110039), (110039, 'd001', 110022)]

In [27]:
#option 2

In [28]:
%%sql
SELECT 
    e1.*
FROM
    emp_manager e1
        JOIN
    emp_manager e2 ON e1.emp_no = e2.manager_no
WHERE
    e2.emp_no IN (SELECT 
            manager_no
        FROM
            emp_manager);

 * mysql://root:***@localhost/employees
2 rows affected.

[(110039, 'd001', 110022), (110022, 'd001', 110039)]

In [ ]:
#Extract the information about all department managers who were hired between the 1st of January 1990 and the 1st of January 1995.

In [29]:
%%sql
SELECT dm.*
FROM dept_manager dm
WHERE dm.emp_no IN (SELECT e.emp_no
				FROM employees e
                WHERE e.hire_date >= '1990-01-01' 
                and e.hire_date <= '1995-01-01');

 * mysql://root:***@localhost/employees
2 rows affected.

[(110420, 'd004', datetime.date(1996, 8, 30), datetime.date(9999, 1, 1)),
 (111877, 'd009', datetime.date(1992, 9, 8), datetime.date(1996, 1, 3))]

In [30]:
# check manager name using exists-not exists

In [31]:
%%sql
SELECT e.first_name, e.last_name
FROM employees e
WHERE EXISTS(SELECT 
					*
			FROM 
				dept_manager dm
			WHERE dm.emp_no = e.emp_no);
            
#order by
SELECT e.first_name, e.last_name
FROM employees e
WHERE EXISTS(SELECT 
					*
			FROM 
				dept_manager dm
			WHERE dm.emp_no = e.emp_no)
ORDER BY emp_no;

 * mysql://root:***@localhost/employees
24 rows affected.
24 rows affected.

[('Margareta', 'Markovitch'),
 ('Vishwani', 'Minakawa'),
 ('Ebru', 'Alpin'),
 ('Isamu', 'Legleitner'),
 ('Shirish', 'Ossenbruggen'),
 ('Karsten', 'Sigstam'),
 ('Krassimir', 'Wegerle'),
 ('Rosine', 'Cools'),
 ('Shem', 'Kieras'),
 ('Oscar', 'Ghazalie'),
 ('DeForest', 'Hagimont'),
 ('Leon', 'DasSarma'),
 ('Peternela', 'Onuegbe'),
 ('Rutger', 'Hofmeyr'),
 ('Sanjoy', 'Quadeer'),
 ('Dung', 'Pesch'),
 ('Przemyslawa', 'Kaelbling'),
 ('Hauke', 'Zhang'),
 ('Arie', 'Staelin'),
 ('Hilary', 'Kambil'),
 ('Tonny', 'Butterworth'),
 ('Marjo', 'Giarratana'),
 ('Xiaobin', 'Spinelli'),
 ('Yuchang', 'Weedman')]

In [32]:
#Select the entire information for all employees whose job title is “Assistant Engineer”.

In [33]:
%%sql
SELECT e.*
FROM employees e
WHERE EXISTS(SELECT t.emp_no
			FROM titles t
            WHERE e.emp_no =t.emp_no 
            AND t.title = 'Assistant Manager');

 * mysql://root:***@localhost/employees
0 rows affected.

[]

In [34]:
#create a table called “emp_manager” (emp_no – integer of 11, not null; dept_no – CHAR of 4, null; manager_no – integer of 11, not null).

In [35]:
%%sql
DROP TABLE IF EXISTS emp_manager;

CREATE TABLE emp_manager (

   emp_no INT(11) NOT NULL,

   dept_no CHAR(4) NULL,

   manager_no INT(11) NOT NULL

);

 * mysql://root:***@localhost/employees
0 rows affected.
0 rows affected.

[]

In [36]:
#Fill emp_manager with data about employees, the number of the department they are working in, and their managers.

In [37]:
%%sql
Insert INTO emp_manager 
SELECT 
    u.*
FROM
(
	SELECT 
		a.*
	FROM
		(SELECT 
				e.emp_no AS employee_ID,
					MIN(de.dept_no) AS department_code,
					(SELECT 
							emp_no
						FROM
							dept_manager
						WHERE
							emp_no = 110022) AS manager_ID
			FROM
				employees e
			JOIN dept_emp de ON e.emp_no = de.emp_no
			WHERE
				e.emp_no <= 10020
			GROUP BY e.emp_no
			ORDER BY e.emp_no) AS a 
	UNION SELECT 
		b.*
	FROM
		(SELECT 
				e.emp_no AS employee_ID,
					MIN(de.dept_no) AS department_code,
					(SELECT 
							emp_no
						FROM
							dept_manager
						WHERE
							emp_no = 110039) AS manager_ID
			FROM
				employees e
			JOIN dept_emp de ON e.emp_no = de.emp_no
			WHERE
				e.emp_no <= 10040 and e.emp_no > 10020
			GROUP BY e.emp_no
			ORDER BY e.emp_no) AS b
	UNION SELECT 
		c.*
	FROM
		(SELECT 
				e.emp_no AS employee_ID,
					MIN(de.dept_no) AS department_code,
					(SELECT 
							emp_no
						FROM
							dept_manager
						WHERE
							emp_no = 110039) AS manager_ID
			FROM
				employees e
			JOIN dept_emp de ON e.emp_no = de.emp_no
			WHERE
				e.emp_no = 110022
			GROUP BY e.emp_no
			ORDER BY e.emp_no) AS c
	UNION SELECT 
		d.*
	FROM
		(SELECT 
				e.emp_no AS employee_ID,
					MIN(de.dept_no) AS department_code,
					(SELECT 
							emp_no
						FROM
							dept_manager
						WHERE
							emp_no = 110022) AS manager_ID
			FROM
				employees e
			JOIN dept_emp de ON e.emp_no = de.emp_no
			WHERE
				e.emp_no = 110039
			GROUP BY e.emp_no
			ORDER BY e.emp_no) AS d
) as u;

 * mysql://root:***@localhost/employees
42 rows affected.

[]